""" Для выполнения этого задания вам помогут методы списков"""

# Покупки на сегодня
today = ["лемон", "блокнот", "кола", "ручка", "сигареты", "молоко", "лампочка"]

# Покупки на завтра
tomorrow = []

# Удалить сигареты из списка today

# Добавить все орехи из списка nuts в список today
nuts = ["фисташки", "грецкие орехи"]

# Заменить колу на максым

# Вставить миндаль между фисташками и грецкими орехами

# Добавить курут в конец списка today

# Всё не съедобное переместить в покупки на завтра

# В итоге списки на сегодня и завтра должны выглядеть так:
print(today) # ['блокнот', 'ручка', 'лампочка']
print(tomorrow) # ['лемон', 'максым', 'молоко', 'фисташки', 'миндаль', 'грецкие орехи', 'курут']
