"""Программа Записная книга

Создать список contacts из словарей с ключами name и phone,

Создать функционалы:
вывод на экран всех контактов,
поиск по имени или номеру телефона в одной функции.
Добавление, Редактирование и Удаление контакта
(Имя и номер  должны быть уникальными!)

Запуск программы должен быть с циклом, показывающим все Контакты
и спрашивающим одну из функций на выбор или выйти1

"""

 # Дополнительная домашка №8

"""Зарплата.

В отделе работают 3 сотрудника, которые получают зарплату в сомах.
Определить: На сколько зп самого высокооплачиваемого из них
отличается от самого низкооплачиваемого.

Входные данные: Пользователь вводит 3 числа - зарплаты сотрудников.
Выходные данные: Вывести на экран одно число - разницу между максимальной и минимальной зарплатой.
"""
